aunali1/Minix2.0.4-RPi/man/man8/inet.8
.TH INET 8
.SH NAME
inet \- TCP/IP server
.SH SYNOPSIS
.B inet
.SH DESCRIPTION
.de SP
.if t .sp 0.4
.if n .sp
..
.B Inet
is the TCP/IP server.  It is a device driver that interfaces between the
file server and the low level ethernet device driver.  The interface to this
server is described in
.BR ip (4).
.PP
.B Inet
is part of the kernel image under standard Minix.  Under Minix-vmd it
starts as a normal process, but by using a few low level system calls it
quickly turns itself into a server.
.SH "SEE ALSO"
.BR ip (4).
.SH ACKNOWLEDGMENTS
Cindy Crawford, for providing invaluable help debugging this server.
.SH AUTHOR
Kees J. Bot (kjb@cs.vu.nl)

.\"
.\" $PchId: inet.8,v 1.3 1996/05/07 21:04:06 philip Exp $
